## Q21

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT *
FROM Customer, Orders
WHERE Customer.custid=Orders.custid
ORDER BY Customer.custid;'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

        0
0  118000

## Q22

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT name, saleprice 
FROM Customer, Orders
WHERE Customer.custid=Orders.custid;'''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1

       0
0  15000

## Q23

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT name, SUM(saleprice)
FROM Customer, Orders
WHERE Customer.custid=Orders.custid
GROUP BY Customer.name
ORDER BY Customer.name;'''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1

        0           1     2      3
0  118000  11800.0000  6000  21000

## Q24

In [25]:
import pandas as pd
import pymysql

In [26]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [27]:
cur_1=conn1.cursor()

In [28]:
sql='''SELECT Customer.name, book.bookname 
FROM Customer, Orders, Book 
WHERE Customer.custid=Orders.custid AND Orders.bookid=Book.bookid;'''

In [29]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [30]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0
0  10

## Q25

In [31]:
import pandas as pd
import pymysql

In [32]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [33]:
cur_1=conn1.cursor()

In [34]:
sql='''SELECT stomer.name, book.bookname
FROM Customer, Orders, Book 
WHERE Customer.custid=Orders.custid AND Orders.bookid=Book.bookid 
AND Book. price=20000; '''

In [35]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [36]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0  1      2
0  1  3  39000
1  2  2  15000
2  3  3  31000
3  4  2  33000

## Q26(외부조인)

In [37]:
import pandas as pd
import pymysql

In [38]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [39]:
cur_1=conn1.cursor()

In [40]:
sql='''SELECT Customer.name, saleprice 
FROM Customer LEFT OUTER JOIN Orders 
ON Customer.custid=Orders.custid;'''

In [41]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [42]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0  1
0  1  2
1  3  2
2  4  2

## Q27

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT bookname FROM Book 
WHERE price = (SELECT MAX(price) FROM Book);'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

        0
0  118000

## Q28

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT name FROM Customer 
WHERE custid IN (SELECT custid FROM Orders);'''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1

       0
0  15000

## Q29

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT name FROM Customer 
WHERE custid IN(SELECT custid FROM Orders 
WHERE bookid IN(SELECT bookid FROM Book WHERE publisher='대한미디어'));'''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1

        0           1     2      3
0  118000  11800.0000  6000  21000

## Q30

In [25]:
import pandas as pd
import pymysql

In [26]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [27]:
cur_1=conn1.cursor()

In [28]:
sql='''SELECT b1.bookname
FROM Book b1
WHERE b1.price > (SELECT avg(b2.price) FROM Book b2 
WHERE b2.publisher=b1.publisher);'''

In [29]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [30]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0
0  10

## Q31

In [31]:
import pandas as pd
import pymysql

In [32]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [33]:
cur_1=conn1.cursor()

In [34]:
sql='''SELECT name 
FROM Customer 
WHERE address LIKE '대한민국%'
UNION  
SELECT name
FROM Customer 
WHERE custid IN (SELECT custid FROM Orders); '''

In [35]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [36]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0  1      2
0  1  3  39000
1  2  2  15000
2  3  3  31000
3  4  2  33000

## Q26(외부조인)

In [37]:
import pandas as pd
import pymysql

In [38]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [39]:
cur_1=conn1.cursor()

In [40]:
sql='''SELECT Customer.name, saleprice 
FROM Customer LEFT OUTER JOIN Orders 
ON Customer.custid=Orders.custid;'''

In [41]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [42]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0  1
0  1  2
1  3  2
2  4  2